import math
from random import random, randint

#Згенеруйте послідовність з 5 цілих чисел з діапазону (0, 100)
sequence = [randint(0, 100) for i in range(5)]
#• Згенеруйте випадкове дробове число
f = random()
#• Виведіть змінні вище
print(sequence)
print(f)
#• Знайдіть максимальний елемент згенерованої послідовності
max_elem = max(sequence)
print(max_elem)
#• Виконайте цілочисельне ділення між максимальним елементом та згенерованим дробовим числом
dev = max_elem//f
print(dev)
#• Знайдіть факторіал отриманого результату
fact = math.factorial(int(dev))
print(fact)
#• Згенеруйте послідовність з 10 цілих чисел з діапазону (0, 50)
seq = [randint(0, 50) for i in range (10)]
print(seq)
#• Згенеруйте випадкове ціле число з діапазону (1, 10) і піднесіть його до степені 3
powered = math.pow(randint(1, 10), 3)
#• Виведіть суму всіх чисел згенерованої послідовності
summed = sum(seq)
print(summed)
#• Знайдіть середнє арифметичне згенерованої послідовності
arithmetic_mean = sum(seq)/len(seq)
print(arithmetic_mean)
#• Виконайте цілочисельне ділення між сумою всіх чисел згенерованої послідовності та згенерованим дробовим числом
dev2 = summed//randint(1, 10)
print(dev2)
#Згенеруйте послідовність з 10 випадкових чисел з діапазону (1, 100) і знайдіть їх середнє арифметичне.
seq2 = [randint(1, 100) for i in range(10)]
print(sum(seq2)//len(seq2))
#Згенеруйте послідовність з 15 випадкових чисел з діапазону (-50, 50) і знайдіть суму всіх чисел, які діляться на 5 без остачі.
seq3 = [randint(-50, 50) for i in range(15)]
print(sum([i for i in seq3 if i%5 == 0]))